; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph4 - mode
	spectrograph2 - mode
	thermograph1 - mode
	spectrograph3 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Star2 - direction
	GroundStation0 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 spectrograph3)
	(supports instrument1 thermograph4)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
)
(:goal (and
	(have_image Planet5 spectrograph2)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 spectrograph0)
	(have_image Star8 spectrograph3)
	(have_image Planet9 thermograph4)
	(have_image Star10 spectrograph0)
	(have_image Planet11 thermograph4)
	(have_image Star12 spectrograph2)
))

)

; plan
1. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 planet9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet9)
   goals met: 0 of 8
5. (take_image satellite0 planet9 instrument1 thermograph4)
   added: (have_image planet9 thermograph4)
   goals met: 1 of 8
6. (turn_to satellite0 planet11 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet11)
   goals met: 1 of 8
7. (take_image satellite0 planet11 instrument1 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation0 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 8
9. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 8
10. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 8
11. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 2 of 8
12. (turn_to satellite0 phenomenon7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 8
13. (take_image satellite0 phenomenon7 instrument2 spectrograph0)
   added: (have_image phenomenon7 spectrograph0)
   goals met: 3 of 8
14. (turn_to satellite0 star10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star10)
   goals met: 3 of 8
15. (take_image satellite0 star10 instrument2 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 4 of 8
16. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 4 of 8
17. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
18. (turn_to satellite0 star2 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star2)
   goals met: 4 of 8
19. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 4 of 8
20. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 4 of 8
21. (take_image satellite0 planet5 instrument0 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 5 of 8
22. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   goals met: 5 of 8
23. (take_image satellite0 planet6 instrument0 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 6 of 8
24. (turn_to satellite0 star12 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star12)
   goals met: 6 of 8
25. (take_image satellite0 star12 instrument0 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 7 of 8
26. (turn_to satellite0 star8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
27. (take_image satellite0 star8 instrument0 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 8 of 8
